In [59]:
import pandas as pd

In [62]:
week1= pd.read_csv('Restaurant - Week 1 Sales.csv')
week2= pd.read_csv('Restaurant - Week 2 Sales.csv')

In [68]:
pd.concat(objs=[week1,week2])
pd.concat([week1,week2],ignore_index=False)
pd.concat([week1,week2],ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [75]:
sales= pd.concat(objs=[week1,week2],keys=['Week1','Week2'])

In [78]:
sales.loc['Week2']

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

In [82]:
sales.loc[('Week1',221),['Customer ID','Food ID']]
sales.loc[('Week2',170),['Customer ID','Food ID']]

Customer ID    922
Food ID          2
Name: (Week2, 170), dtype: int64